<!-- dflook/terraform-github-actions {"workspace":"binary-plan","backend_type":"remote","plan_modifier":"b0290c8150ae92d755bd7f79918a5400b47951132d040bb679259d282742cb6d","backend":"509569e4e705ab28100f8b23e0db47f03492ab17039acfe9329237c81825eccb","plan_job_ref":"Job Test plan target and replace #400 at https://github.com/dflook/terraform-github-actions/actions/runs/7447862722","plan_hash":"b9855ad3213b5cb49b4a2c22d0f38883d9fc8dbc290b31d94b98bb20818846cf","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __binary-plan__ workspace
Targeting resources: `random_string.count[0]`
With variables: `length = 5`
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] must be replaced
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      length      = 10 -> 5 # forces replacement
!~      result      = "**********" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!~  count = "OYM5Z2IhAj" -> (known after apply)
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the
│ result of this plan may not represent all of the changes requested by the
│ current configuration.
│ 		
│ The -target option is not for routine use, and is provided only for
│ exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵
```
</details>

:memo: Plan generated in [Test plan target and replace #400](https://github.com/dflook/terraform-github-actions/actions/runs/7447862722)